import { createSlice } from "@reduxjs/toolkit";

export const estimateSlice = createSlice({
  name: "estimate",
  initialState: [
    {
      id: 1,
      content: [
        "同時委託的多項商品都可以算一筆委託手續費100元（5個賣場或網站以內），每多5個賣場或網站則會另外產生50元手續費",
        "ex.同時委託5個mercari賣場，委託手續費是100元，6~10個賣場是100+50=150元，11~15個賣場是100+50+50=200元，以此類推",
        "ex.同時委託同一個網站內的15項商品，委託收續費是100元；同時委託6個不同網站的商品，則委託收續費是100+50=150元",
      ],
    },
    {
      id: 2,
      content: [
        "每日匯率適用到下一個營業日的早上8:59，超過時間則匯率會更改，報價也會不同喔！",
      ],
    },
    {
      id: 3,
      content: [
        "單次委託的商品總額（日幣）低於1500日幣時，會另外加收手續費50元",
      ],
    },
    {
      id: 4,
      content: ["加成過後的報價總額（台幣）會無條件進位"],
    },
    {
      id: 5,
      content: [
        "此報價系統只能計算可刷卡之普通商品通販網站的報價，其他支付方式、或香水等特殊商品，會產生其他費用",
      ],
    },
    {
      id: 6,
      content: ["此報價系統僅供參考，正確報價還是以浣熊告知的金額為準喔！"],
    },
  ],
});

export default estimateSlice.reducer;
